window.dataLoaded = false;
let title_of_eom = themeOfDEC;
const data = {
    "index_1":{
        "subtitle": "Ознакомьтесь с правилами техники безопасности при ведении технологического процесса на установке селективной очистки масел.",
        "step_of_popup": "Ознакомьтесь с правилами техники безопасности при ведении технологического процесса на установке селективной очистки масел.",
        "paragraph_1":[
            {"image": true, "image_path": "./content/page_content/img1.png","img_sign": " ", "left_img": false, "no_sgn": true},
            {"text": `
                <div class="ol_custom">
               <ol>
                   <li>Использование индивидуальных средств защиты;</li>
                   <li>Помещения, в котором обращаются растворители, должны быть оборудованы приточно-вытяжной вентиляцией;</li>
                   <li>Осторожно обращаться с растворителями, что бы, не повредить тару, в которой находится растворитель;</li>
                   <li>Операции по эксплуатации и обслуживанию установок проводить только согласно инструкциям;</li>
                   <li>Обязательная проверка сточных вод на содержание растворителей;</li>
                   <li>Постоянный контроль за предельным уровнем в емкостях с растворителем;</li>
                   <li>Контроль за ходом технологического режима работы установки.</li>
                </ol>
                </div>`}
            //{"text2": "<b class='blue_header big_rectangle'>I. Общие положения</b>"},
        ]
    },
    "index_2":{
        "subtitle": "Изучите направление движения фаз в экстракционной колонне селективной очистки масел фенолом.",
        "step_of_popup": "Изучите направление движения фаз в экстракционной колонне селективной очистки масел фенолом.",
        "paragraph_1":[
            {"text": `<b class='blue_header'>Экстракция </b>– это такой процесс при котором происходит извлечение одного вещества из раствора при использовании растворителя.`},
            {"text": `При процессе экстракции сырье – масляный дистиллят  и несмешивающийся с ним растворитель – фенол контактируют между собой, в результате чего образуются экстракт – раствор извлекаемого вещества в экстрагенте и рафинат – остаточный исходный раствор, из которого удалены эстрагируемые компоненты.`},
            {"text": `Сырье (масляный дистиллят) подается в верхнюю часть, противотоком ему в нижнюю часть экстрактора подается растворитель (фенол), С верха экстрактора выводится экстрактный раствор и далее он направляется на регенерацию, где после выделения из него растворителя получают экстракт. С низа эктрактора выводится рафинатный раствор, после извлечения из которого растворитель, получают целевой продукт – рафинат.`}
        ],
        "paragraph_2":[
            {"image": true, "image_path": "./content/page_content/img2.png","img_sign": " ", "left_img": false, "no_sgn": true}
        ],
    },
    "index_3":{
        "subtitle": "Обозначьте на схеме экстракционной колоны необходимые потоки",
        "step_of_popup": "Обозначьте на схеме экстракционной колоны необходимые потоки",
        "test":[
            {"type": 3},
            {"image": true, "image_path": "./content/tests_content/03_01.png"},
            {"answers": [
                "Масляный дистилят",
                "Фенол",
                "Экстракт",
                "Рафинат"
            ]}
        ]
    },
    "index_4":{
        "subtitle": "Изучите понятие материального баланса и схему материальных потоков процесса селективной очистки и основные обозначения.",
        "step_of_popup": "Изучите понятие материального баланса и схему материальных потоков процесса селективной очистки и основные обозначения.",
        "paragraph_1":[
            {"text": `<b class="blue_header">Материальный баланс установки</b> – уравнение, в котором масса всех видов сырья и материалов, поступающих на переработку (приход), равна массе получаемых продуктов плюс производственные потери (расход).`}
        ],
        "paragraph_2":[
            {"image": true, "image_path": "./content/page_content/img3.png","img_sign": " ", "left_img": false, "no_sgn": true}
        ],
        "paragraph_3":[
            {"text": `Для расчетов используются следующие обозначения, которые показаны на схеме материальных потоков:`}
        ],
        "paragraph_4":[
            {"image": true, "image_path": "./content/page_content/img4.png","img_sign": " ", "left_img": false, "no_sgn": true}
        ],
        "paragraph_5":[
            {"text": `<b class="blue_header">Обозначения</b>`}
        ],
        "paragraph_6":[
            {"image": true, "image_path": "./content/page_content/img5.png","img_sign": " ", "left_img": false, "no_sgn": true}
        //     {"text": `<div class='two_img_custom'>
        //         <div>
        //             <img src='./content/page_content/img10.png'>
        //             <p><b>а)</b> «звезда» «треугольник»</p>
        //         </div>
        //         <div>
        //             <img src='./content/page_content/img11.png'>
        //              <p><b>б)</b> «треугольник» «звезда» </p>
        //         </div>
        //         </div>`}
        ],
    },
    "index_5":{
        "subtitle": "Изучите методику расчета материального баланса процесса селективной очистки масел фенолом и экстракционной колонны.",
        "step_of_popup": "Изучите методику расчета материального баланса процесса селективной очистки масел фенолом и экстракционной колонны.",
        "paragraph_1": [
            {"text": "Сначала составляем уравнение материального баланса экстракционной колонны:"},
            {"text2": "<p class='formula_custom'><img  src='./content/page_content/img5_0.png'></p>"},
            {"text": "Далее последовательно определяем необходимые параметры:"},
            {"text": "<b class='blue_header'>1. Объемный расход сырья:</b>"},
            {"text2": "<p class='formula_custom'><img  src='./content/page_content/img5_1.png'></p>"},
            {"text": "<b class='blue_header'>2. Плотность сырья:</b>"},
            {"text2": "<p class='formula_custom'><img  src='./content/page_content/img5_2.png'></p>"},
            {"text": "<b class='blue_header'>3. Массовый расход рафинатного раствора:</b>"},
            {"text2": "<p class='formula_custom'><img  src='./content/page_content/img5_3.png'></p>"},
            {"text": "<b class='blue_header'>4. Плотность рафинатного раствора:</b>"},
            {"text2": "<p class='formula_custom'><img  src='./content/page_content/img5_4.png'></p>"},
            {"text": "<b class='blue_header'>5.Объемный выход рафинатного раствора:</b>"},
            {"text2": "<p class='formula_custom'><img  src='./content/page_content/img5_5.png'></p>"},
            {"text": "<b class='blue_header'>6. Массовый выход экстрактного раствора определяется из материального баланса экстрактора по компоненту В:</b>"},
            {"text2": "<p class='formula_custom'><img  src='./content/page_content/img5_6.png'></p>"},
            {"text": "<b class='blue_header'>7. Плотность экстрактного раствора:</b>"},
            {"text2": "<p class='formula_custom'><img  src='./content/page_content/img5_7.png'></p>"},
            {"text": "<b class='blue_header'>8. Объемный выход экстрактного раствора:</b>"},
            {"text2": "<p class='formula_custom'><img  src='./content/page_content/img5_8.png'></p>"},
            {"text": "<b class='blue_header'>9. Выход растворителя:</b>"}
        ],
        "paragraph_6":[
            {"text": `<div class='two_img_custom'>
                <div>
                    <p><b></b>- массовый расход</p>
                    <img src='./content/page_content/img5_1.png'>
                </div>
                <div>
                    <p><b></b>- объемный расход</p>
                    <img src='./content/page_content/img5_2.png'>
                </div>
            </div>`}
        ]
    },
    "index_6":{
        "subtitle": "Определите, какой из параметров процесса селективной очистки масел определяет каждая из предложенных формул",
        "step_of_popup": "Определите, какой из параметров процесса селективной очистки масел определяет каждая из предложенных формул",
        "test":[
            {"type": 9},
            {"description": "Тут пишем описание задания"},
            {"definitions": [
                "<p class='popup_zoom_plc'><img class='answer_or_definition_img' src='./content/tests_content/06_01.png' alt='1'></p>",
                "<p class='popup_zoom_plc'><img class='answer_or_definition_img' src='./content/tests_content/06_03.png' alt='1'></p>",
                "<p class='popup_zoom_plc'><img class='answer_or_definition_img' src='./content/tests_content/06_02.png' alt='1'></p>",
                "<p class='popup_zoom_plc'><img class='answer_or_definition_img' src='./content/tests_content/06_04.png' alt='1'></p>",
                "<p class='popup_zoom_plc'><img class='answer_or_definition_img' src='./content/tests_content/06_05.png' alt='1'></p>",
                "<p class='popup_zoom_plc'><img class='answer_or_definition_img' src='./content/tests_content/06_06.png' alt='1'></p>"
            ]},
            {"answers": [
                "<p class='popup_zoom_plc zoom_paragraph'><span class='p_custom'>Уравнение материального баланса</span></p>",
                "<p class='popup_zoom_plc zoom_paragraph'><span class='p_custom'>Объемный расход сырья</span></p>",
                "<p class='popup_zoom_plc zoom_paragraph'><span class='p_custom'>Объемный расход рафинатного раствора</span></p>",
                "<p class='popup_zoom_plc zoom_paragraph'><span class='p_custom'>Объемный расход фенольного раствора</span></p>",
                "<p class='popup_zoom_plc zoom_paragraph'><span class='p_custom'>Объемный расход растворителя</span></p>",
                "<p class='popup_zoom_plc zoom_paragraph'><span class='p_custom'>Массовый расход растворителя</span></p>"
            ]},
            {"correct_answer_type_10": [1, 3, 2, 4, 5, 6]},
            {"image": true, "image_path": "./content/tests_content/empty_img.png", "image_sgn": "blablabla"}
        ],
    },
    "index_7":{
        "subtitle": "Пример расчета материального баланса  процесса селективной очистки масел.",
        "step_of_popup": "Пример расчета материального баланса  процесса селективной очистки масел.",
        "paragraph_1": [
            {"text": "Используя исходные данные произведем расчет материального баланса."},
            {"text": "<b>Исходные данные</b>"}
        ],
        "paragraph_2": [
            {"image": true, "image_path": "./content/page_content/img7.png","img_sign": " ", "left_img": false, "no_sgn": true}
        ],
        "paragraph_3": [
            {"text": "<b>Расчетные параметры</b>"}
        ],
        "paragraph_4": [
            {"image": true, "image_path": "./content/page_content/img7_2.png","img_sign": " ", "left_img": false, "no_sgn": true}
        ]
    },
    "index_8":{
        "subtitle": "Используя исходные данные, рассчитайте необходимые строки, введите правильные ответы после таблицы.",
        "step_of_popup": "Используя исходные данные, рассчитайте необходимые строки, введите правильные ответы после таблицы.",
        "test":[
            {"type": 2},
            {"description": `<p class='blue_header'><b>Исходные данные для расчета:</b></p>
                                </b> <br>
                                <table class='table_custom'>
                        <tr>
                            <th>Исходные данные</th>
                            <th>Количество</th>
                        </tr>
                        <tr>
                            <td>Производительность установки по сырью</td>
                            <td>100 000 т/год</td>
                        </tr>
                        <tr>
                            <td>Кратность фенола к сырью</td>
                            <td>3:1</td>
                        </tr>
                        <tr>
                            <td>Рафинат</td>
                            <td>66 %</td>
                        </tr>
                        <tr>
                            <td>Экстракт</td>
                            <td>34 %</td>
                        </tr>
                                </table> <br>
                            <p class='blue_header'><b>Расчетные параметры:</b></p><br>`},
            {"test_with_text_2": 
                `<table class='table_custom'>
                <tr>
                    <th>Статьи баланса</th>
                    <th>% мас., на сырье</th>
                    <th>Количество, т/год</th>
                </tr>
                <tr style="background-color: rgb(146,208,80);">
                    <td>Приход:</td>
                    <td></td>
                    <td></td>
                </tr>
                <tr>
                    <td>Сырье (дистиллятное масло)</td>
                    <td>100</td>
                    <td>Ответ 1</td>
                </tr>
                <tr>
                    <td>Растворитель (фенол)</td>
                    <td>300</td>
                    <td>Ответ 2</td>
                </tr>
                <tr>
                    <td>Всего:</td>
                    <td>400</td>
                    <td>Ответ 3</td>
                </tr>
                <tr style="background-color: rgb(146,208,80);">
                    <td>Расход:</td>
                    <td> </td>
                    <td> </td>
                </tr>
                <tr>
                    <td>Рафинат</td>
                    <td>66</td>
                    <td>Ответ 4</td>
                </tr>
                <tr>
                    <td>Экстракт</td>
                    <td>34</td>
                    <td>Ответ 5</td>
                </tr>
            </table><br>
            Ответ 1 = {=100000}<br>
            Ответ 2 = {=300000}<br>
            Ответ 3 = {=400000}<br>
            Ответ 4 = {=66000}<br>
            Ответ 5 = {=34000}<br> `},
            {"image": false, "image_path": "./content/page_content/empty_img.png"}
        ]
    },
    "index_9":{
        "subtitle": "Используя исходные данные, рассчитайте необходимые строки, введите правильные ответы после таблицы.",
        "step_of_popup": "Используя исходные данные, рассчитайте необходимые строки, введите правильные ответы после таблицы.",
        "test":[
            {"type": 2},
            {"description": `<p class='blue_header'><b>Исходные данные для расчета:</b></p>
                                </b> <br>
                                <table class='table_custom'>
                        <tr>
                            <th>Исходные данные</th>
                            <th>Количество</th>
                        </tr>
                        <tr>
                            <td>Производительность установки по сырью</td>
                            <td>300 000 т/год</td>
                        </tr>
                        <tr>
                            <td>Кратность фенола к сырью</td>
                            <td>2:1</td>
                        </tr>
                        <tr>
                            <td>Рафинат</td>
                            <td>56%</td>
                        </tr>
                        <tr>
                            <td>Экстракт</td>
                            <td>44%</td>
                        </tr>
                                </table> <br>
                            <p class='blue_header'><b>Расчетные параметры:</b></p><br>`},
            {"test_with_text_2": 
                `<table class='table_custom'>
                <tr>
                    <th>Статьи баланса</th>
                    <th>% мас., на сырье</th>
                    <th>Количество, т/год</th>
                </tr>
                <tr style="background-color: rgb(146,208,80);">
                    <td>Приход:</td>
                    <td></td>
                    <td></td>
                </tr>
                <tr>
                    <td>Сырье (дистиллятное масло)</td>
                    <td>100</td>
                    <td>Ответ 1</td>
                </tr>
                <tr>
                    <td>Растворитель (фенол)</td>
                    <td>200</td>
                    <td>Ответ 2</td>
                </tr>
                <tr>
                    <td>Всего:</td>
                    <td>300</td>
                    <td>Ответ 3</td>
                </tr>
                <tr style="background-color: rgb(146,208,80);">
                    <td>Расход:</td>
                    <td> </td>
                    <td> </td>
                </tr>
                <tr>
                    <td>Рафинат</td>
                    <td>56</td>
                    <td>Ответ 4</td>
                </tr>
                <tr>
                    <td>Экстракт</td>
                    <td>44</td>
                    <td>Ответ 5</td>
                </tr>
            </table><br>
            Ответ 1 = {=300000}<br>
            Ответ 2 = {=600000}<br>
            Ответ 3 = {=900000}<br>
            Ответ 4 = {=168000}<br>
            Ответ 5 = {=132000}<br> `},
            {"image": false, "image_path": "./content/page_content/empty_img.png"}
        ]
    },
    "index_10":{
        "subtitle": "Изучите методику составления теплового баланса колонны экстракции установки селективной очистки масел фенолом.",
        "step_of_popup": "Изучите методику составления теплового баланса колонны экстракции установки селективной очистки масел фенолом.",
        "paragraph_1": [
            {"text": "Тепловой баланс колонны составляется с целью определения количества рециркулята."},
            {"text": "<b class='blue_header'>1. Составляем уравнение теплового баланса колонны:</b>"},
            {"text2": "<p class='formula_custom'><img src='./content/page_content/img10_01.png'></p>"},
            {"text": 
                `где Q<sub>прих</sub> – общее количество приходящего тепла, Вт;<br>
                 Q<sub>расх</sub> – общее количество уходящего тепла, Вт.`}
        ],
        "paragraph_2": [
            {"text": "<b class='blue_header'>2. Тепловые потоки компонентов:</b>"},
            {"text2": "<p class='formula_custom'><img src='./content/page_content/img10_02.png'></p>"},
            {"text": 
                `где Q – тепловой поток, Вт;<br>
                 𝐺 – расход, кг/с;<br>
                 𝐼<sup>ж</sup><sub>t</sub> – энтальпия жидкой фазы при соответствующей температуре, кДж/кг.<br>`}
        ],
        "paragraph_3": [
            {"text": "<b class='blue_header'>3. Энтальпии веществ по упрощенному уравнению Крэга:</b>"},
            {"text2": "<p class='formula_custom'><img src='./content/page_content/img10_03.png'></p>"},
        ],
        "paragraph_4": [
            {"text": "<b class='blue_header'>4. Относительная плотность:</b>"},
            {"text2": "<p class='formula_custom'><img src='./content/page_content/img10_04.png'></p>"},
            {"text": 
                `где 5а – поправка на изменение плотности при изменении температуры на один градус `}
        ]
    },
    "index_11":{
        "subtitle": "Определите, какой из параметров расчета теплового баланса, определяет каждая из предложенных формул.",
        "step_of_popup": "Определите, какой из параметров расчета теплового баланса, определяет каждая из предложенных формул.",
        "test":[
            {"type": 9},
            {"description": "Тут пишем описание задания"},
            {"definitions": [
                "<p class='popup_zoom_plc'><img class='answer_or_definition_img' src='./content/tests_content/11_04.png' alt='1'></p>",
                "<p class='popup_zoom_plc'><img class='answer_or_definition_img' src='./content/tests_content/11_02.png' alt='1'></p>",
                "<p class='popup_zoom_plc'><img class='answer_or_definition_img' src='./content/tests_content/11_03.png' alt='1'></p>",
                "<p class='popup_zoom_plc'><img class='answer_or_definition_img' src='./content/tests_content/11_01.png' alt='1'></p>"
            ]},
            {"answers": [
                "<p class='popup_zoom_plc zoom_paragraph'><span class='p_custom'>Уравнение теплового баланса</span></p>",
                "<p class='popup_zoom_plc zoom_paragraph'><span class='p_custom'>Расход по тепловым потокам</span></p>",
                "<p class='popup_zoom_plc zoom_paragraph'><span class='p_custom'>Энтальпия веществ</span></p>",
                "<p class='popup_zoom_plc zoom_paragraph'><span class='p_custom'>Относительна плотность</span></p>"
            ]},
            {"correct_answer_type_10": [4, 2, 3, 1]},
            {"image": true, "image_path": "./content/tests_content/empty_img.png", "image_sgn": "blablabla"}
        ],
    },
    "index_12":{
        "subtitle": "Пример расчета теплового баланса процесса селективной очистки масел.",
        "step_of_popup": "Пример расчета теплового баланса процесса селективной очистки масел.",
        "paragraph_1": [
            {"text": "Используя исходные данные, произведем расчет теплового баланса."},
            {"text": "<b>Исходные данные</b>"}
        ],
        "paragraph_2": [
            {"image": true, "image_path": "./content/page_content/img12_1.png","img_sign": " ", "left_img": false, "no_sgn": true}
        ],
        "paragraph_3": [
            {"text": "<b>Расчетные параметры</b>"}
        ],
        "paragraph_4": [
            {"image": true, "image_path": "./content/page_content/img12_2.png","img_sign": " ", "left_img": false, "no_sgn": true}
        ]
    },
    "index_13":{
        "subtitle": "Используя исходные данные, рассчитайте необходимые строки, введите правильные ответы после таблицы.",
        "step_of_popup": "Используя исходные данные, рассчитайте необходимые строки, введите правильные ответы после таблицы.",
        "test":[
            {"type": 2},
            {"description": `<p class='blue_header'><b>Исходные данные для расчета:</b></p>
                                </b> <br>
                                <table class='table_custom'>
                        <tr>
                            <th>Исходные данные</th>
                            <th>Количество</th>
                        </tr>
                        <tr>
                            <td>Расход сырья</td>
                            <td>19,25 кг/с</td>
                        </tr>
                        <tr>
                            <td>Энтальпия сырья</td>
                            <td>169,95 кДж/кг</td>
                        </tr>
                        <tr>
                            <td>Расход фенола</td>
                            <td>57,75 кг/с</td>
                        </tr>
                        <tr>
                            <td>Энтальпия фенола</td>
                            <td>103,68 кДж/кг</td>
                        </tr>
                                </table> <br>
                            <p class='blue_header'><b>Расчетные параметры:</b></p><br>`},
            {"test_with_text_2": 
                `<table class='table_custom'>
                <tr>
                    <th>Поток</th>
                    <th>Количество тепла, Q Вт</th>
                </tr>
                <tr>
                    <td>Сырье (дистиллятное масло)</td>
                    <td>Ответ 1</td>
                </tr>
                <tr>
                    <td>Растворитель (фенол)</td>
                    <td>Ответ 2</td>
                </tr>
            </table><br>
            Ответ 1 = {=3271537}<br>
            Ответ 2 = {=5987520}<br>`},
            {"image": false, "image_path": "./content/page_content/empty_img.png"}
        ]
    },
    "index_14":{
        "subtitle": "Результаты",
        "step_of_popup": "Результаты",
        "result":[]
    },
}
window.dataLoaded = true;